<template>
  <view>
    <view style="text-align: center;font-size: 20px;">硬件工程师港湾小程序用户服务条款</view>
    <view>重要提示：</view>
    <view>
      硬件工程师港湾特别提示您，在使用硬件工程师港湾小程序及相应客户端服务前，请事先认真阅读本服务条款内容，特别是关于用户义务、用户责任及硬件工程师港湾有限保证及免责的条款。硬件工程师港湾网站及相应客户端的各类业务规则构成本服务条款的组成部分。拟注册用户在进行注册过程中，点击“我已仔细阅读并接受硬件工程师港湾用户服务条款”即表示您完全接受并同意遵守本服务条款的全部内容。如您不同意本服务条款，请立即停止注册及使用。
      硬件工程师港湾有权不时对本服务条款（包括各类业务规则）作出修改或补充，并通过硬件工程师港湾网站或相应客户端公布。您继续访问和使用硬件工程师港湾即视为您接受修订后的本服务条款。否则，您有权通过停止访问且拒绝使用本服务、删除账号等方式终止本服务条款。
      拟注册用户应具备我国法律规定的与您从事行为相应的民事行为能力，并需同意遵守所有服务条款之约束，在按照规定流程完成注册程序后，才能成为硬件工程师港湾的正式注册用户并享受硬件工程师港湾提供的更全面的服务。如果您代表某个机构而非您个人注册、登录和使用硬件工程师港湾，则您将被认为获得充分授权代表该机构同意本服务条款。
    </view>
  </view>
</template>

<script>
  export default {
    data() {
      return {

      }
    },
    methods: {

    }
  }
</script>

<style>

</style>
